{
  "_name_or_path": "albert-base-v2",
  "architectures": ["AlbertForSequenceClassification"],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 2,
  "classifier_dropout_prob": 0.1,
  "down_scale_factor": 1,
  "embedding_size": 128,
  "eos_token_id": 3,
  "gap_size": 0,
  "hidden_act": "gelu_new",
  "hidden_dropout_prob": 0,
  "hidden_size": 768,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2",
    "3": "LABEL_3",
    "4": "LABEL_4",
    "5": "LABEL_5",
    "6": "LABEL_6",
    "7": "LABEL_7",
    "8": "LABEL_8",
    "9": "LABEL_9",
    "10": "LABEL_10",
    "11": "LABEL_11",
    "12": "LABEL_12",
    "13": "LABEL_13",
    "14": "LABEL_14",
    "15": "LABEL_15",
    "16": "LABEL_16",
    "17": "LABEL_17",
    "18": "LABEL_18",
    "19": "LABEL_19",
    "20": "LABEL_20",
    "21": "LABEL_21",
    "22": "LABEL_22",
    "23": "LABEL_23",
    "24": "LABEL_24",
    "25": "LABEL_25",
    "26": "LABEL_26",
    "27": "LABEL_27",
    "28": "LABEL_28",
    "29": "LABEL_29",
    "30": "LABEL_30"
  },
  "initializer_range": 0.02,
  "inner_group_num": 1,
  "intermediate_size": 3072,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_10": 10,
    "LABEL_11": 11,
    "LABEL_12": 12,
    "LABEL_13": 13,
    "LABEL_14": 14,
    "LABEL_15": 15,
    "LABEL_16": 16,
    "LABEL_17": 17,
    "LABEL_18": 18,
    "LABEL_19": 19,
    "LABEL_2": 2,
    "LABEL_20": 20,
    "LABEL_21": 21,
    "LABEL_22": 22,
    "LABEL_23": 23,
    "LABEL_24": 24,
    "LABEL_25": 25,
    "LABEL_26": 26,
    "LABEL_27": 27,
    "LABEL_28": 28,
    "LABEL_29": 29,
    "LABEL_3": 3,
    "LABEL_30": 30,
    "LABEL_4": 4,
    "LABEL_5": 5,
    "LABEL_6": 6,
    "LABEL_7": 7,
    "LABEL_8": 8,
    "LABEL_9": 9
  },
  "label2category": {
    "0": "Biscuits, Chin Chin & Cookies",
    "1": "Pasta & Noodles",
    "2": "Chocolates & Sweets",
    "3": "Flour & Baking Powder",
    "4": "Baking Tools & Accessories",
    "5": "Fruit Juices & Yoghurt",
    "6": "Nuts & Seeds",
    "7": "Sugar, Honey & Sweeteners",
    "8": "Canned Foods",
    "9": "Salt & Seasoning Cubes",
    "10": "Everyday Tea",
    "11": "Grains & Rice",
    "12": "Oats & Instant Cereals",
    "13": "Breakfast & Cereals",
    "14": "Cooking Tools & Accessories",
    "15": "Cooking Sauces",
    "16": "Alcoholic Drinks",
    "17": "Fizzy Drinks & Malt",
    "18": "Non-Alcoholic Drinks",
    "19": "Snacks & Confectioneries",
    "20": "Butter, Cheese & Other Spreads",
    "21": "Herbs & Spices",
    "22": "Chips & Snacks",
    "23": "Herbal Teas",
    "24": "Beverages & Milk",
    "25": "Diapering",
    "26": "Baby & Toddler Health",
    "27": "Daily Care",
    "28": "Feeding & Nursing",
    "29": "Toys & Gears",
    "30": "School Bag"
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "albert",
  "net_structure_type": 0,
  "num_attention_heads": 12,
  "num_hidden_groups": 1,
  "num_hidden_layers": 12,
  "num_memory_blocks": 0,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.42.3",
  "type_vocab_size": 2,
  "vocab_size": 30000
}
